# Lab 4 Rumana Khan and Peter Hughs LC

Q1: Make an SQL query which checks if A is a superkey for relation T(A,B,C,D)

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///lab4.db3

'Connected: @lab4.db3'

In [3]:
%%sql drop table if exists Worker;
create table Worker(
       EmployeeID       varchar primary key,     -- number 
       name             varchar,                 -- name of Employee
       department       varchar,                 -- name of the department
       salary           int                      -- Salary of Employee           
);
insert into Worker values('123','Sarah', 'Sales', 65);
insert into Worker values('124','Sally', 'Sales', 67);
insert into Worker values('125','Bill', 'HR', 65);
insert into Worker values('137','Sarah', 'HR', 75);
insert into Worker values('138','Michael', 'Operations', 95);

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql drop table if exists Work;
create table Work(
       name             varchar,                 -- name of Employee
       department       varchar,                 -- name of the department
       salary           int,                     -- Salary of Employee           
       title            varchar                  -- Title of Employee in the Department  
);
insert into Work values('Sarah', 'Sales', 65, 'Manager');
insert into Work values('Sally', 'Sales', 67, 'Associate');
insert into Work values('Bill', 'HR', 65, 'Worker');
insert into Work values('Sarah', 'HR', 75, 'Assistant Manager');
insert into Work values('Michael', 'Operations', 95, 'Manager');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql 

SELECT COUNT(*)
FROM Worker as WorkerA, Worker as WorkerB
WHERE WorkerA.EmployeeID = WorkerB.EmployeeID and
(WorkerA.name != WorkerB.name or WorkerA.department != WorkerB.department or WorkerA.salary != WorkerB.salary)

 * sqlite:///lab4.db3
Done.

[(0,)]

In [6]:
%%sql 

SELECT COUNT(*)
FROM Work as WorkA, Work as WorkB
WHERE WorkA.name = WorkB.name and
(WorkA.title != WorkB.title or WorkA.department != WorkB.department or WorkA.salary != WorkB.salary)

 * sqlite:///lab4.db3
Done.

[(2,)]

For this first table, the Superkey is EmployeeID, and then the other table does not have a superkey. This can be shown also by the count that is generated. For the first table (Worker) since EmployeeID isn't repeated, the count stays at 0. However, for the second table (Work) when the name is repeated the count goes up.

Q2: Make an SQL query where the combinations of two attributes in the relation are each keys

In [7]:
%%sql drop table if exists Worker1;
create table Worker1(
       name             varchar,                 -- name of Employee*
       department       varchar,                 -- name of the department
       salary           int,                     -- Salary of Employee           
       title            varchar                  -- Title of Employee in the Department* 
);
insert into Worker1 values('Sarah', 'Sales', 65, 'Manager');
insert into Worker1 values('Sally', 'Sales', 67, 'Associate');
insert into Worker1 values('Bill', 'HR', 65, 'Worker');
insert into Worker1 values('Sarah', 'HR', 75, 'Assistant Manager');
insert into Worker1 values('Michael', 'Operations', 95, 'Manager');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [8]:
%%sql drop table if exists Worker2;
create table Worker2(
       name             varchar,                 -- name of Employee
       department       varchar,                 -- name of the department
       salary           int,                     -- Salary of Employee           
       title            varchar                  -- Title of Employee in the Department  
);
insert into Worker2 values('Sarah', 'Sales', 65, 'Manager');
insert into Worker2 values('Sally', 'Sales', 67, 'Associate');
insert into Worker2 values('Bill', 'HR', 65, 'Worker');
insert into Worker2 values('Sarah', 'HR', 75, 'Manager');
insert into Worker2 values('Michael', 'Operations', 95, 'Manager');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql drop table if exists Works1;
create table Works1(
       name             varchar,                 -- name of Employee*
       department       varchar,                 -- name of the department*
       salary           int,                     -- Salary of Employee           
       title            varchar                  -- Title of Employee in the Department  
);
insert into Works1 values('Sarah', 'Sales', 65, 'Manager');
insert into Works1 values('Sally', 'Sales', 67, 'Associate');
insert into Works1 values('Bill', 'HR', 65, 'Worker');
insert into Works1 values('Sarah', 'HR', 75, 'Manager');
insert into Works1 values('Michael', 'Operations', 95, 'Manager');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [10]:
%%sql drop table if exists Works2;
create table Works2(
       name             varchar,                 -- name of Employee
       department       varchar,                 -- name of the department
       salary           int,                     -- Salary of Employee           
       title            varchar                  -- Title of Employee in the Department
);
insert into Works2 values('Sarah', 'Sales', 65, 'Manager');
insert into Works2 values('Sally', 'Sales', 67, 'Associate');
insert into Works2 values('Bill', 'HR', 65, 'Worker');
insert into Works2 values('Sarah', 'Sales', 75, 'Assistant Manager');
insert into Works2 values('Michael', 'Operations', 95, 'Manager');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
%%sql 

SELECT COUNT(*)
FROM Worker1 as Worker1A, Worker1 as Worker1B
WHERE Worker1A.name = Worker1B.name and Worker1A.title = Worker1B.title and 
(Worker1A.department != Worker1B.department or Worker1A.salary != Worker1B.salary)

 * sqlite:///lab4.db3
Done.

[(0,)]

In [12]:
%%sql 

SELECT COUNT(*)
FROM Worker2 as Worker2A, Worker2 as Worker2B
WHERE Worker2A.name = Worker2B.name and Worker2A.title = Worker2B.title and 
(Worker2A.department != Worker2B.department or Worker2A.salary != Worker2B.salary)

 * sqlite:///lab4.db3
Done.

[(2,)]

In [13]:
%%sql 

SELECT COUNT(*)
FROM Works1 as Works1A, Works1 as Works1B
WHERE Works1A.name = Works1B.name and  Works1A.department = Works1B.department and
(Works1A.title != Works1B.title or Works1A.salary != Works1B.salary)

 * sqlite:///lab4.db3
Done.

[(0,)]

In [14]:
%%sql 

SELECT COUNT(*)
FROM Works2 as Works2A, Works2 as Works2B
WHERE Works2A.name = Works2B.name and  Works2A.department = Works2B.department and
(Works2A.title != Works2B.title or Works2A.salary != Works2B.salary)

 * sqlite:///lab4.db3
Done.

[(2,)]

For question 2, we have four tables - (Worker1, Worker2, Works1, Works2). Both Worker1 and Works1 result in a 0 for the count, so these are true. For Worker1, we used name and title as a key. For Works1, we used name and department as a key.

Q3: Make an SQL where a TGD between A and B with some shared attributes (use Sailors, Reserves, and Boats)

In [15]:
%%sql drop table if exists ReservesT;
create table ReservesT(
       sid            int,                        -- sailor number 
       bid            int,                        -- boat number   
        sname         varchar,                    -- sailor name
        bname         varchar,                    -- boat name
       day        varchar primary key            -- day of reservation
);

insert into ReservesT values(22, 101, 'dustin', 'interlake', '10/10/96');
insert into ReservesT values(58, 103, 'rusty', 'clipper', '11/12/96');
insert into ReservesT values(66, 124, 'john', 'stella', '12/24/98');
insert into ReservesT values(69, 124, 'jared','stella', '12/28/98');
insert into ReservesT values(88, 103, 'riley', 'clipper', '11/12/99');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [16]:
%%sql drop table if exists SailorsT;
create table SailorsT(
       sid        int primary key,  -- sailor ID
       sname        varchar,        -- name of Sailor
       rating       int,            --number of rating
       age          double          --age of Sailor
);

insert into SailorsT values(22, 'dustin', 7, 45.0);
insert into SailorsT values(58, 'rusty', 10, 35.0);
insert into SailorsT values(66, 'john', 8, 52.0);
insert into SailorsT values(69, 'jared', 9, 356.0);
insert into SailorsT values(88, 'riley', 8, 55.5);

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [26]:
%%sql 

SELECT COUNT(*)
FROM ReservesT 
NATURAL JOIN SailorsT
where ReservesT.sid = SailorsT.sid

 * sqlite:///lab4.db3
Done.

[(5,)]

In [18]:
%%sql drop table if exists ReservesF;
create table ReservesF(
       sid            int,                        -- sailor number 
       bid            int,                        -- boat number   
        sname         varchar,                    -- sailor name
        bname         varchar,                    -- boat name
       day        varchar primary key            -- day of reservation
);

insert into ReservesF values(22, 101, 'dustin', 'interlake', '10/10/96');
insert into ReservesF values(58, 103, 'rusty', 'clipper', '11/12/96');
insert into ReservesF values(66, 124, 'john', 'stella', '12/24/98');
insert into ReservesF values(69, 124, 'jared','stella', '12/28/98');
insert into ReservesF values(88, 103, 'riley', 'clipper', '11/12/99');

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%%sql drop table if exists SailorsF;
create table SailorsF(
       sid        int primary key,  -- sailor ID
       sname        varchar,        -- name of Sailor
       rating       int,            --number of rating
       age          double          --age of Sailor
);

insert into SailorsF values(22, 'dustin', 7, 45.0);
insert into SailorsF values(31, 'lubber', 8, 55.5);
insert into SailorsF values(58, 'rusty', 10, 35.0);
insert into SailorsF values(88, 'riley', 8, 55.5);
insert into SailorsF values(74, 'mark', 10, 35.0);

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [25]:
%%sql 

SELECT COUNT(*)
FROM ReservesF as A
NATURAL JOIN SailorsF as B
where A.sid = B.sid

 * sqlite:///lab4.db3
Done.

[(3,)]

For question 3, we have ReservesT and SailorsT which are true, while ReservesF and SailorsF are false. We joined the reserves and sailors tables together and then counted the amount of times that the SID was the same. For the first two tables, the count was 5 and there are only 5 tuples, this means that each A.sid has a B.sid. However, for the last two tables, the count is only at 3 even though there are 5 tuples, which means that each A.sid did find a B.sid to match, which is why this is a false instance of a TGD.

Q4: Make an SQL which checks for a MVD

In [29]:
%%sql drop table if exists CarT;
create table CarT(
       company           varchar,                 -- name of the company that makes the car 
       model             varchar,                 -- name of the model of the car
       year              int,                     -- year car was made
       color             varchar,                 -- color of car           
       price             int                      -- price of car
);
insert into CarT values ('Ford', 'Crown Vic', 2011, 'red', 88);
insert into CarT values ('Ford', 'Crown Vic', 2011, 'black', 83);
insert into CarT values ('Ford', 'Crown Vic', 2011, 'blue', 73);
insert into CarT values ('Nissan', 'GTR', 2020, 'black', 83);
insert into CarT values ('Nissan', 'GTR', 2020, 'red', 88);

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [32]:
%%sql 

SELECT COUNT(*)
FROM CarT as CarA, CarT as CarB, CarT as CarC
WHERE CarA.company = CarB.company and CarB.company = CarC.company and 
(CarC.model != CarA.model) and (CarC.year != CarB.year)

 * sqlite:///lab4.db3
Done.

[(0,)]

In [35]:
%%sql drop table if exists Carf;
create table Carf(
       company           varchar,                 -- name of the company that makes the car 
       model             varchar,                 -- name of the model of the car
       year              int,                     -- year car was made
       color             varchar,                 -- color of car           
       price             int                      -- price of car
);
insert into Carf values ('Ford', 'Crown Vic', 2011, 'red', 88);
insert into Carf values ('Ford', 'Chevy', 2012, 'red', 88);
insert into Carf values ('Honda', 'Civic', 2013, 'blue', 78);
insert into Carf values ('Honda', 'Accord', 2019, 'blue', 78);
insert into Carf values ('Honda', 'Civic', 2012, 'blue', 78);

 * sqlite:///lab4.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [36]:
%%sql 

SELECT COUNT(*)
FROM Carf as CarA, Carf as CarB, Carf as CarC
WHERE CarA.company = CarB.company and CarB.company = CarC.company and 
(CarC.model != CarA.model) and (CarC.year != CarB.year)

 * sqlite:///lab4.db3
Done.

[(10,)]

For this last question, we had some trouble. The query we made is counting each time the tuple isn't meeting the criteria listed for this question. Therefore, the first table is true and the last table is false. The first table CarT has a count of 0, where the 3rd tuple when equal to the 1st and 2nd tuple doesn't equal the other attributes in the tuple. Meanwhile for table carf the tuples might start off with the same company attribute value, but they have completely different values for the other attributes.